{
  "ui": {
    "autoSolver": "Auto Solver",
    "newBoard": "New Board",
    "boardSize": "Board Size",
    "blockSize": "Block Size",
    "noBlocks": "No blocks",
    "load": "Load",
    "save": "Save",
    "ok": "OK",
    "cancel": "Cancel",
    "close": "Close",
    "copyToClipboard": "Copy to Clipboard",
    "saveDialogNote": "Note: data for unselected rules will be lost."
  },
  "rule": {
    "givenNumbers": {
      "title": "Given Numbers",
      "explanation": "Already given numbers as clues."
    },
    "blocks": {
      "title": "Blocks",
      "explanation": "In each block, the numbers from 1 to the size of the board must appear exactly once. Blocks that do not match the size of the board will be ignored."
    },
    "oddEven": {
      "title": "Odd/Even",
      "explanation": "Numbers in cells with circles must be odd. Numbers in cells with squares must be even."
    },
    "nonConsecutive": {
      "title": "Non-Consecutive",
      "explanation": "Numbers in adjacent cells cannot differ by 1."
    },
    "xv": {
      "title": "XV Sudoku",
      "explanation": "Adjacent cells with numbers summing 10 are marked with X. Adjacent cells with numbers summing 5 are marked with V.",
      "allShown": "All applicable marks are shown: if there is no marker, the sum of the numbers is not 5 or 10."
    },
    "diagonal": {
      "title": "Diagonal",
      "explanation": "In diagonals, the numbers from 1 to the size of the board must appear exactly once.",
      "mainDiagonal": "Applicable to the main diagonal (from the top left to the bottom right)",
      "antiDiagonal": "Applicable to the anti diagonal (from the top right to the bottom left)"
    },
    "arrow": {
      "title": "Arrow",
      "explanation": "Numbers in cells with circles must be equal to the sum of the numbers in the cells that the adjoining arrows pass through. Left click and drag to create an arrow. Right click to remove an arrow."
    },
    "thermo": {
      "title": "Thermo",
      "explanation": "In each thermometer, the numbers must strictly increase from the bulb to the tip. Left click and drag to create a thermometer. Right click to remove a thermometer."
    },
    "killer": {
      "title": "Killer (Sum)",
      "explanation": "In region, the numbers must sum to the given total. Left click and drag to create a region. Right click to remove a region. Use number keys to input the total value.",
      "distinct": "In each region, the same number can only appear at most once."
    },
    "consecutive": {
      "title": "Consecutive",
      "explanation": "Numbers in cells separated by a gray bar must differ by 1.",
      "allShown": "For adjacent cells which are not separated by a gray bar, the difference is not 1."
    }
  }
}
